Backend/XML_backend/XML_agent/test.xml

<soap-env:Envelope xmlns:soap-env="http://schemas.xmlsoap.org/soap/envelope/">
  <soap-env:Body>
    <ns0:newRoomRequest xmlns:ns0="http://www.team17.xml.ftn.uns.ac.rs/NewRoom">
      <ns0:id>1</ns0:id>
      <ns0:room>
        <ns0:hotelId>1</ns0:hotelId>
        <ns0:address>
          <ns0:country>opfksod</ns0:country>
          <ns0:state>opfsoplf</ns0:state>
          <ns0:city>fldms</ns0:city>
          <ns0:postalCode>fomds</ns0:postalCode>
          <ns0:street>23</ns0:street>
          <ns0:streetNumber>2</ns0:streetNumber>
          <ns0:lat>2</ns0:lat>
          <ns0:lng>3</ns0:lng>
        </ns0:address>
        <ns0:type>
          <ns0:id>1</ns0:id>
        </ns0:type>
        <ns0:category>
          <ns0:id>1</ns0:id>
        </ns0:category>
        <ns0:defaultPrice>32</ns0:defaultPrice>
        <ns0:numberOfPeople>2</ns0:numberOfPeople>
        <ns0:cancelationDays>2</ns0:cancelationDays>
        <ns0:additionalServices>
          <ns0:id>1</ns0:id>
        </ns0:additionalServices>
        <ns0:additionalServices>
          <ns0:id>13</ns0:id>
        </ns0:additionalServices>
        <ns0:description>kijiok</ns0:description>
        <ns0:totalRating></ns0:totalRating>
        <ns0:numberOfRatings></ns0:numberOfRatings>
        <ns0:roomNumber>7</ns0:roomNumber>
      </ns0:room>
    </ns0:newRoomRequest>
  </soap-env:Body>
</soap-env:Envelope>
